//На большинстве Московских олимпиад каждый участник заполняет персональную карточку участника на которой 
//указан 4(5)-значный номер карточки. Ясно, что не все числа из этого диапазона используются. 
//Придумайте способы кодирования карточек, удовлетворяющие следующим требованиям:
//1) При минимальном диапазоне возможных значений номеров в него должно умещаться максимальное число карточек, то есть не следует кодировать номера карточек десятизначными последовательностями.
//2)Система кодирования должна уметь исправлять одну (две, ...) ошибки в написании номера карточек (то есть если школьник ошибется в одной (двух, ...) цифрах при переписывании номера карточек, то эта ошибка может быть исправлена, например, после ввода информации в компьютер).
//3)Система кодирования должна быть максимально простой, например, номера карточек должны образовывать арифметическую прогрессию. Также желательно сделать максимально простым и алгоритм исправления ошибок в номере карточки.
//Можете придумать и свои критерии к системе кодирования номеров карточек.